Revit 2027 API
SpaceSet.Erase Method
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	Space item
)
Public Overridable Function Erase (
	item As Space
) As Integer
public:
virtual int Erase(
	Space^ item
)
abstract Erase :
        item : Space -> int
override Erase :
        item : Space -> int
Parameters
item Space
Return Value
Int32
See Also
Reference
SpaceSet Class
Autodesk.Revit.DB.Mechanical Namespace